import React from 'react'

const Test: React.FC = () => {
  return (
    <p>
      TEST PAGES

      다음 표는 대니얼 네틀이 구분하는 다섯가지 성격모델을 확인하는 방법입니다.

      전혀 아니다, 별로 아니다, 중간이다, 약간 그렇다, 매우 그렇다의 다섯단계로 답하세요.

      1-6번, 10-12번의 경우 전혀 아니다를 1로 시작해서 매우 그렇다를 5로 두고,

      7-9번은 전혀 아니다 5로 시작해서 매우 그렇다를 1로 두고 계산합니다.

      1. 모르는 사람에게 먼저 말을 건다

      2. 다른 사람이 편안하고 행복한지 확인한다

      3. 그림, 글, 음악을 창작한다

      4. 모든 일을 사전에 준비한다

      5. 울적하거나 우울함을 느낀다

      6. 회식, 파티, 사교모임을 계획한다

      7. 사람들을 모욕한다

      8. 철학적이거나 영적인 문제들을 생각한다

      9. 일이나 물건을 정리하지 않고 어지럽게 그냥 둔다

      10. 스트레스나 걱정을 느낀다

      11. 어려운 단어를 사용한다

      12. 타인의 감정에 공감한다

      각 성격타입은 다음과 같으며, 해당 문항을 더한 것이 자신의 점수입니다.

      외향성 1+6

      신경성 5+10

      성실성 4+9

      친화성 2+7+12

      개방성 3+8+11
    </p>
  )
}

export default Test
